# GetSpecificationGUID Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..GetSpecificationGUID Method
FabricationConfiguration Class See Also
---
Gets the specification GUID by its identifier.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public Guid GetSpecificationGUID(
	int specificationId
)
```

Visual Basic
---
```text
Public Function GetSpecificationGUID ( _
	specificationId As Integer _
) As Guid
```

Visual C++
---
```text
public:
Guid GetSpecificationGUID(
	int specificationId
)
```

# ### Parameters
specificationId
    Type: System..::..Int32 The specification identifier.
# ### Return Value
The specification GUID. Returns empty GUID if not found.
# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace